Documents/ЛБ_НазначениеГруппыОбъектамЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_НазначениеГруппыОбъектамЗалога</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_ГруппыОбъектовЗалога</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНазначенияГруппы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗалоговыйБилет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЗалога</Name>
							<Comment>Объект залога</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаНовая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ГруппыОбъектовЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_РеквизитыОбъектаЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_РеквизитыОбъектаЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИзделия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыИзделий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проба</Name>
					<Comment>Проба</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клеймо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКлейм</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Именник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_Именник</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеИменника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеИзделия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СостояниеИзделия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дефекты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Comment>Вес изделия</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесЧистый</Name>
					<Comment>Чистый вес</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесВПробеЧистоты</Name>
					<Comment>Вес в пробе чистоты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеИзделия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМеталлы</Name>
					<Comment>Сумма оценки металлов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиКамни</Name>
					<Comment>Сумма оценки драг. камней</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСсуды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вставки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес30</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ГруппыОбъектовЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ГруппыОбъектовЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ГруппыОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЛБ_НазначениеГруппыОбъектамЗалога/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	    Если НЕ ТекПользователь.ЭтоЛомбард Тогда
       		Объект.Ответственный = ТекПользователь;
		Иначе
			Объект.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		КонецЕсли;	
		Объект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить(); 
		Объект.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис;
		Объект.Дата = ТекущаяДатаСеанса();
		ЭтаФорма.Заголовок = "Назначение группы объектам залога (создание)";
	Иначе
	    ЭтаФорма.Заголовок = "Назначение группы объектам залога № " + СокрЛП(Объект.ПредставлениеНомера) + " от " + Формат(Объект.Дата, "ДЛФ=DT"); 	
	КонецЕсли;
	УстановитьСостояниеДокумента();  
	УстановитьВидимость();
	ЗаполнитьТаблицуТоваров();    
	Элементы.Склад.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов());
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры   

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры   
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.НомерНазначенияГруппы = 0;
		Объект.ПредставлениеНомера = "";   
		Для каждого стр Из Объект.Товары Цикл  
			Стр.ГруппаНовая = ПредопределенноеЗначение("Справочник.ЛБ_ГруппыОбъектовЗалога.ПустаяСсылка");
		Конеццикла;	
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	Если НЕ Объект.НомерНазначенияГруппы = 0 тогда 
		Элементы.Ломбард.ТолькоПросмотр = Истина;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТаблицуДокумента()
	Объект.Товары.Загрузить(ТаблицаТоваров.Выгрузить());
КонецПроцедуры

&НаСервере
Функция ПолучитьНовыйНомерНГ()   
	СтруктураВозврата = Новый Структура;  
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НомерНГ = ЛБ_УправлениеЛомбардом.ПолучитьНовыйНомерНазначенияГруппы(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Ссылка);
    Иначе
	    НомерНГ = ЛБ_УправлениеЛомбардом.ПолучитьНовыйНомерНазначенияГруппы(Объект.Дата, Объект.Организация, Объект.Ломбард); 
	КонецЕсли;	
	СтруктураВозврата.Вставить("НомерНГ", НомерНГ);	
	ПредставлениеНомера = СокрЛП(НомерНГ);	  
	СтруктураВозврата.Вставить("ПредставлениеНомера", ПредставлениеНомера);
    Возврат СтруктураВозврата;
КонецФункции	

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаполнитьТаблицуДокумента();  
	Если Объект.НомерНазначенияГруппы = 0 Тогда
		Результат = ПолучитьНовыйНомерНГ();
		Объект.НомерНазначенияГруппы = Результат.НомерНГ;
		Объект.ПредставлениеНомера = Результат.ПредставлениеНомера;
	КонецЕсли;
	Если НЕ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Если ТаблицаТоваров.Количество() = 0 Тогда
			Сообщить("Не выбраны изделия для установки групп.", статуссообщения.Важное);
			Отказ = Истина;
		КонецЕсли;    
				
		Если Отказ Тогда
			Возврат;
		КонецЕсли;	
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтоги()
	ИтогКоличество = ТаблицаТоваров.Итог("Количество");
	ИтогВес = ТаблицаТоваров.Итог("ВесИзделия"); 
	ИтогВесМеталла = ТаблицаТоваров.Итог("ВесМеталла");
    ИтогСуммаОценки = ТаблицаТоваров.Итог("СуммаОценки");
	ИтогСуммаОценкиМакс = ТаблицаТоваров.Итог("СуммаОценкиМакс"); 
	ИтогСуммаОценкиМеталлы = ТаблицаТоваров.Итог("СуммаОценкиМеталлы");
	ИтогСуммаОценкиВставки = ТаблицаТоваров.Итог("СуммаОценкиВставки");
	ИтогСуммаСсуды = ТаблицаТоваров.Итог("СуммаСсуды");
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТаблицуТоваров()  
	Запрос = Новый Запрос;  
	СписокОЗ = Новый СписокЗначений;
	СписокЗБ = Новый СписокЗначений;
	Для каждого Стр Из Объект.Товары Цикл 
		Если СписокЗБ.НайтиПоЗначению(Стр.ЗалоговыйБилет) = неопределено Тогда 
			СписокЗБ.Добавить(Стр.ЗалоговыйБилет);
		КонецЕсли;	
		Если СписокОЗ.НайтиПоЗначению(Стр.ОбъектЗалога) = неопределено Тогда 
			СписокОЗ.Добавить(Стр.ОбъектЗалога);
		КонецЕсли;	
	КонецЦикла;	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);  
	Запрос.УстановитьПараметр("ДатаНач", ?(Объект.Проведен, Объект.Дата-1, Объект.Дата)); 
	Запрос.УстановитьПараметр("ЗалоговыеБилеты", СписокЗБ); 
	Запрос.УстановитьПараметр("ОбъектыЗалога", СписокОЗ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК ВесИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесМеталла,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиКамни КАК СуммаОценкиВставки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаСсуды КАК СуммаСсуды,
	               |	1 КАК Количество,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вставки КАК Вставки,
	               |	ЛБ_ГруппыОбъектовЗалогаСрезПоследних.Группа КАК Группа
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
	               |			&Дата,
	               |			ОбъектЗалога В (&ОбъектыЗалога)
	               |				И ЗалоговыйБилет В (&ЗалоговыеБилеты)) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ГруппыОбъектовЗалога.СрезПоследних(&ДатаНач, ) КАК ЛБ_ГруппыОбъектовЗалогаСрезПоследних
	               |		ПО ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ОбъектЗалога";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаТоваров.Загрузить(ТаблицаЗапроса);  
	
	Для каждого стр Из ТаблицаТоваров Цикл
		Отбор = новый структура;
		Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет);   
		Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
		
		Строки = Объект.Товары.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;	
		Стр.ГруппаНовая = Строки.Получить(0).ГруппаНовая; 
		Если НЕ ЗначениеЗаполнено(Стр.Группа) Тогда
		    Стр.Группа = "<не назначена>";
		КонецЕсли;	
	КонецЦикла;	
	ЗаполнитьИтоги();
КонецПроцедуры	

&НаСервере
Процедура ПолучитьТоварыПоОстаткам()  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбарда(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад);  
	Объект.Товары.Загрузить(ТаблицаЗапроса);
	Объект.Товары.Сортировать("ЗалоговыйБилет");
КонецПроцедуры	
	 
&НаКлиенте
Процедура Заполнить(Команда) 
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	
	ПолучитьТоварыПоОстаткам();
	ЗаполнитьТаблицуТоваров();
КонецПроцедуры 

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)
	Элементы.Склад.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов()); 
	Объект.НомерНазначенияГруппы = 0;
	Объект.ПредставлениеНомера = "";
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокВыбораСкладов() 
	Если ЗначениеЗаполнено(Объект.Ломбард) Тогда
        Возврат ЛБ_Общиймодуль.ПолучитьСписокВыбораСкладов(Объект.Ломбард); 
	Иначе                    
		Возврат Новый Массив;
	КонецЕсли;
КонецФункции	

&НаСервере
Процедура ДобавитьВТаблицуТоваров(ТаблицаОЗ)  
	Запрос = Новый Запрос;  
	СписокОЗ = Новый СписокЗначений;
	СписокЗБ = Новый СписокЗначений;
	Для каждого Стр Из ТаблицаОЗ Цикл 
		Если СписокЗБ.НайтиПоЗначению(Стр.ЗалоговыйБилет) = неопределено Тогда 
			СписокЗБ.Добавить(Стр.ЗалоговыйБилет);
		КонецЕсли;	
		Если СписокОЗ.НайтиПоЗначению(Стр.ОбъектЗалога) = неопределено Тогда 
			СписокОЗ.Добавить(Стр.ОбъектЗалога);
		КонецЕсли;	
	КонецЦикла;	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);     
	Запрос.УстановитьПараметр("ДатаНач", ?(Объект.Проведен, Объект.Дата-1, Объект.Дата));
	Запрос.УстановитьПараметр("ЗалоговыеБилеты", СписокЗБ); 
	Запрос.УстановитьПараметр("ОбъектыЗалога", СписокОЗ);
	Запрос.Текст = "ВЫБРАТЬ
               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК ВесИзделия,
               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесМеталла,
               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиКамни КАК СуммаОценкиВставки,
               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаСсуды КАК СуммаСсуды,
               |	1 КАК Количество,
               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вставки КАК Вставки,
               |	ЛБ_ГруппыОбъектовЗалогаСрезПоследних.Группа КАК Группа
               |ИЗ
               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
               |			&Дата,
               |			ОбъектЗалога В (&ОбъектыЗалога)
               |				И ЗалоговыйБилет В (&ЗалоговыеБилеты)) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ГруппыОбъектовЗалога.СрезПоследних(&ДатаНач, ) КАК ЛБ_ГруппыОбъектовЗалогаСрезПоследних
               |		ПО ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ЗалоговыйБилет
               |			И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ОбъектЗалога";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТаблицаЗапроса Цикл 
		Отбор = Новый структура;
		Отбор.Вставить("ЗалоговыйБилет", стр.ЗалоговыйБилет);
		Отбор.Вставить("ОбъектЗалога", стр.ОбъектЗалога);
		СтрокиТ = ТаблицаТоваров.НайтиСтроки(Отбор);
		Если СтрокиТ.Количество() = 0 Тогда
		    НоваяСтр = ТаблицаТоваров.Добавить(); 
			НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
			НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;
			НоваяСтр.Артикул = Стр.Артикул;
			НоваяСтр.ВидИзделия = Стр.ВидИзделия;
			НоваяСтр.Проба = Стр.Проба;
			НоваяСтр.Категория = Стр.Категория;
			НоваяСтр.ВесИзделия = Стр.ВесИзделия;
			НоваяСтр.ВесМеталла = Стр.ВесМеталла;
			НоваяСтр.СуммаОценки = Стр.СуммаОценки;
			НоваяСтр.СуммаОценкиМакс = Стр.СуммаОценкиМакс;
			НоваяСтр.СуммаОценкиМеталлы = Стр.СуммаОценкиМеталлы;
			НоваяСтр.СуммаОценкиВставки = Стр.СуммаОценкиВставки;
			НоваяСтр.СуммаСсуды = Стр.СуммаСсуды;
			НоваяСтр.Количество = Стр.Количество;
			НоваяСтр.Вставки = Стр.Вставки;  
			НоваяСтр.Группа = ?(ЗначениеЗаполнено(Стр.Группа), Стр.Группа, "<не назначена>");
		КонецЕсли;	
	Конеццикла;    
	ЗаполнитьИтоги();
КонецПроцедуры	

&НаСервере
Функция ПолучитьТоварыПоОстаткамАртикул(Артикул)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоАртикулу(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад, Артикул);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделие с артикулом " + сокрЛП(Артикул) + " на складе не найдено.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоАртикулу(Команда) 
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	Артикул = "";
	Если ВвестиЗначение(Артикул, "Введите артикул") Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамАртикул(Артикул);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамНомерЗБ(НомерЗБ)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоНомеруЗБ(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад, НомерЗБ);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия из залогогового билета № " + сокрЛП(НомерЗБ) + " на складе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоНомеруЗБ(Команда)
	НомерЗБ = "";
	Если ВвестиЗначение(НомерЗБ, "Введите номер ЗБ") Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамНомерЗБ(НомерЗБ);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Функция ПолучитьТоварыПоОстаткамПроба(Проба)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоПробе(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад, Проба);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия из металла " + сокрЛП(Проба) + " на складе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоПробе(Команда)
	Проба = ПредопределенноеЗначение("Справочник.ЛБ_Пробы.ПустаяСсылка");
	Если ВвестиЗначение(Проба, "Выберите пробу", Тип("СправочникСсылка.ЛБ_Пробы")) Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамПроба(Проба);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамКатегория(Категория)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоКатегории(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад, Категория);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия категории " + сокрЛП(Категория) + " на складе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоКатегории(Команда)
	Категория = ПредопределенноеЗначение("Справочник.ЛБ_КатегорииОбъектовЗалога.ПустаяСсылка");
	Если ВвестиЗначение(Категория, "Выберите категорию", Тип("СправочникСсылка.ЛБ_КатегорииОбъектовЗалога")) Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамКатегория(Категория);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамБриллианты()  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоВставкамБриллианты(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия с бриллиантами на складене найдены.";
	КонецЕсли;	
КонецФункции	


&НаКлиенте
Процедура ЗаполнитьПоВставкамБриллианты(Команда)
	СтрокаСообщение = ПолучитьТоварыПоОстаткамБриллианты();
	Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
		Предупреждение(СтрокаСообщение, 60);
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Функция ПолучитьТоварыПоОстаткамБезВставок()  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаБезВставок(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия с без вставок на складе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьБезВставок(Команда)
	СтрокаСообщение = ПолучитьТоварыПоОстаткамБезВставок();
	Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
		Предупреждение(СтрокаСообщение, 60);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамДопМеталлы()  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоДопМеталлам(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия с несколькими металлами на складе не найдены.";
	КонецЕсли;	
КонецФункции	


&НаКлиенте
Процедура ЗаполнитьПоДопМатериалам(Команда)
	СтрокаСообщение = ПолучитьТоварыПоОстаткамДопМеталлы();
	Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
		Предупреждение(СтрокаСообщение, 60);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамГруппа(Группа)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоГруппе(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад, Группа);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия с группой " + сокрЛП(Группа) + " на складе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоГруппе(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	Группа = ПредопределенноеЗначение("Справочник.ЛБ_ГруппыОбъектовЗалога.ПустаяСсылка");
	Если ВвестиЗначение(Группа, "Введите группу") Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамГруппа(Группа);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаемщика(ЗБ) 
	Возврат ЗБ.Залогодатель;
КонецФункции

&НаКлиенте
Процедура ИсторияЗБ(Команда)
	ТекСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные;
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ТекСтрока.ЗалоговыйБилет) Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", ПолучитьЗаемщика(ТекСтрока.ЗалоговыйБилет));
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);   
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГруппу(Команда) 
	Если ЭтаФорма.ТаблицаТоваров.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;	
	Группа = ПредопределенноеЗначение("Справочник.ЛБ_ГруппыОбъектовЗалога.ПустаяСсылка");
	Если ВвестиЗначение(Группа, "Выберите группу") Тогда
		Для каждого стр Из ЭтаФорма.ТаблицаТоваров Цикл 
			Стр.ГруппаНовая = Группа;
		КонецЦикла	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамНакладной(НомерНакладной)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоНакладной(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад, НомерНакладной);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия из накладной на отгрузку № " + сокрЛП(НомерНакладной) + " на складе не найдены.";
	КонецЕсли;	
КонецФункции	


&НаКлиенте
Процедура ЗаполнитьПоНакладнойНаОтгрузку(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	НомерНакладной = "";
	Если ВвестиЗначение(НомерНакладной, "Введите номер накладной на отгрузку") Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамНакладной(НомерНакладной);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамПеремещения(НомерПеремещения)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоПеремещению(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад, НомерПеремещения);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия из перемещения объектов залога № " + сокрЛП(НомерПеремещения) + " на складе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоВнутреннемуПеремещению(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	НомерПеремещения = "";
	Если ВвестиЗначение(НомерПеремещения, "Введите номер перемещения объектов залога") Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамПеремещения(НомерПеремещения);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьСостояниеДокумента();  
	УстановитьВидимость();
КонецПроцедуры
